namespace RailTest.Support
{
    /// <summary>
    /// Предоставляет сообщения об ошибке.
    /// </summary>
    public static class ExceptionMessages
    {
        /// <summary>
        /// Возвращает локализованную строку, похожую на
        /// "Пустой массив.".
        /// </summary>
        public static string ArrayEmpty => "Пустой массив.";

        /// <summary>
        /// Возвращает локализованную строку, похожую на
        /// "Размер массива больше максимально допустимого.".
        /// </summary>
        public static string ArrayLargerTheMaximum => "Размер массива больше максимально допустимого.";

        /// <summary>
        /// Возвращает локализованную строку, похожую на
        /// "Размер массива меньше минимально допустимого.".
        /// </summary>
        public static string ArrayLessTheMinimum => "Размер массива меньше минимально допустимого.";

        /// <summary>
        /// Возвращает локализованную строку, похожую на
        /// "Размер коллекции больше максимально допустимого.".
        /// </summary>
        public static string CollectionLargerTheMaximum => "Размер коллекции больше максимально допустимого.";

        /// <summary>
        /// Возвращает локализованную строку, похожую на
        /// "Размеры данных не совпадают.".
        /// </summary>
        public static string DataSizesDoNotMatch => "Размеры данных не совпадают.";

        /// <summary>
        /// Возвращает локализованную строку, похожую на
        /// "После создания перечислителя семейство было изменено.".
        /// </summary>
        public static string EnumerationChanged => "После создания перечислителя семейство было изменено.";

        /// <summary>
        /// Возвращает локализованную строку, похожую на
        /// "Неверная сигнатура файла.".
        /// </summary>
        public static string InvalidFileSignature => "Неверная сигнатура файла.";

        /// <summary>
        /// Возвращает локализованную строку, похожую на
        /// "Неверный формат.".
        /// </summary>
        public static string InvalidFormat => "Неверный формат.";

        /// <summary>
        /// Возвращает локализованную строку, похожую на
        /// "Элемент уже содержится в коллекции.".
        /// </summary>
        public static string ItemAlreadyInCollection => "Элемент уже содержится в коллекции.";

        /// <summary>
        /// Возвращает локализованную строку, похожую на
        /// "Отрицательное или равное нулю значение, которое не является бесконечностью.".
        /// </summary>
        public static string NegativeOrZeroAndNotInfinity => "Отрицательное или равное нулю значение, которое не является бесконечностью.";

        /// <summary>
        /// Возвращает локализованную строку, похожую на
        /// "Отрицательное или равное нулю значение.".
        /// </summary>
        public static string NegativeOrZeroValue => "Отрицательное или равное нулю значение.";

        /// <summary>
        /// Возвращает локализованную строку, похожую на
        /// "Отрицательное значение.".
        /// </summary>
        public static string NegativeValue => "Отрицательное значение.";

        /// <summary>
        /// Возвращает локализованную строку, похожую на
        /// "Значение не содержится в перечислении.".
        /// </summary>
        public static string NotContainedInEnumeration => "Значение не содержится в перечислении.";

        /// <summary>
        /// Возвращает локализованную строку, похожую на
        /// "Операция не поддерживается.".
        /// </summary>
        public static string NotSupported => "Операция не поддерживается.";

        /// <summary>
        /// Возвращает локализованную строку, похожую на
        /// "Пустая ссылка.".
        /// </summary>
        public static string NullReference => "Пустая ссылка.";

        /// <summary>
        /// Возвращает локализованную строку, похожую на
        /// "Объект разрушен.".
        /// </summary>
        public static string ObjectDisposed => "Объект разрушен.";

        /// <summary>
        /// Возвращает локализованную строку, похожую на
        /// "Значение не соответствует допустимому диапазону значений.".
        /// </summary>
        public static string OutOfRange => "Значение не соответствует допустимому диапазону значений.";

        /// <summary>
        /// Возвращает локализованную строку, похожую на
        /// "Операция привела к переполнению.".
        /// </summary>
        public static string OverflowOperation => "Операция привела к переполнению.";

        /// <summary>
        /// Возвращает локализованную строку, похожую на
        /// "Поток не поддерживает чтение.".
        /// </summary>
        public static string StreamNotReadable => "Поток не поддерживает чтение.";

        /// <summary>
        /// Возвращает локализованную строку, похожую на
        /// "Поток не поддерживает поиск.".
        /// </summary>
        public static string StreamNotSearchable => "Поток не поддерживает поиск.";

        /// <summary>
        /// Возвращает локализованную строку, похожую на
        /// "Поток не поддерживает запись.".
        /// </summary>
        public static string StreamNotWritable => "Поток не поддерживает запись.";

        /// <summary>
        /// Возвращает локализованную строку, похожую на
        /// "Длина строки больше максимально допустимой.".
        /// </summary>
        public static string StringLargerTheMaximum => "Длина строки больше максимально допустимой.";

        /// <summary>
        /// Возвращает локализованную строку, похожую на
        /// "Вектор нулевой длины.".
        /// </summary>
        public static string VectorSizeZero => "Вектор нулевой длины.";
    }
}
