hmLoadTopic({
hmKeywords:"",
hmTitle:"Главная центральная система координат",
hmDescription:"Ось OX называется главной осью инерции тела, если центробежные моменты инерции Jxy и Jxz одновременно равны нулю. Через каждую точку тела можно провести три главные оси инерции.",
hmPrevLink:"",
hmNextLink:"",
hmParentLink:"compiling_libraries.html",
hmBreadCrumbs:"",
hmTitlePath:"Компиляция библиотек > Использование библиотек типов интерфейсов Системы КОМПАС-3D",
hmHeader:"<h1 class=\"p_Heading1\"><span class=\"f_Heading1\">Главная центральная система координат <\/span><\/h1>\n\r",
hmBody:"<p class=\"p_bodytext\"><a id=\"xcg1715295\" class=\"hmanchor\"><\/a><\/p>\n\r<p class=\"p_bodytext\"><span class=\"f_bodytext\">Ось OX называется главной осью инерции тела, если центробежные моменты инерции Jxy и Jxz одновременно равны нулю. Через каждую точку тела можно провести три главные оси инерции. Эти оси взаимно перпендикулярны друг другу. Моменты инерции тела относительно трёх главных осей инерции, проведённых в произвольной точке O тела, называются главными моментами инерции тела.<\/span><\/p>\n\r<p class=\"p_bodytext\"><span class=\"f_bodytext\">Главные оси инерции, проходящие через центр масс тела, называются главными центральными осями инерции тела, а моменты инерции относительно этих осей — его главными центральными моментами инерции.<\/span><\/p>\n\r"
})
