namespace Simargl.Analysis.EffectWayIndicators;

/// <summary>
/// Перечисление, которое идентифицирует данные.
/// </summary>
public enum WayParametersKey
{
    /// <summary>
    /// Рельс Р65 на щебне с ж/б шпалами, 2000 шт. на км.
    /// </summary>
    R652000GBS,

    /// <summary>
    /// Рельс Р65 на щебне с ж/б шпалами, 1840 шт. на км.
    /// </summary>
    R651840GBS,

    /// <summary>
    /// Рельс Р65 на щебне с деревянными шпалами, 2000 шт. на км.
    /// </summary>
    R652000IIS,

    /// <summary>
    /// Рельс Р65 на щебне с деревянными шпалами, 1840 шт. на км.
    /// </summary>
    R651840IIS,

    /// <summary>
    /// Рельс Р50 на гравии с деревянными шпалами, 2000 шт. на км.
    /// </summary>
    R502000IIGR,

    /// <summary>
    /// Рельс Р50 на гравии с деревянными шпалами, 1840 шт. на км.
    /// </summary>
    R501840IIGR,

    /// <summary>
    /// Рельс Р50 на гравии с деревянными шпалами, 1600 шт. на км.
    /// </summary>
    R501600IIGR,

    /// <summary>
    /// Рельс Р50 на песке с деревянными шпалами, 2000 шт. на км.
    /// </summary>
    R502000IIP,

    /// <summary>
    /// Рельс Р50 на песке с деревянными шпалами, 1840 шт. на км.
    /// </summary>
    R501840IIP,

    /// <summary>
    /// Рельс Р50 на песке с деревянными шпалами, 1600 шт. на км.
    /// </summary>
    R501600IIP,

    /// <summary>
    /// Рельс Р65 на гравии с деревянными шпалами, 2000 шт. на км.
    /// </summary>
    R652000IIGR,

    /// <summary>
    /// Рельс Р65 на гравии с деревянными шпалами, 1840 шт. на км.
    /// </summary>
    R651840IIGR,

    /// <summary>
    /// Рельс Р65 на гравии с деревянными шпалами, 1600 шт. на км.
    /// </summary>
    R651600IIGR,

    /// <summary>
    /// Рельс Р50 на щебне с деревянными шпалами, 2000 шт. на км.
    /// </summary>
    R502000IIS,

    /// <summary>
    /// Рельс Р50 на щебне с деревянными шпалами, 1840 шт. на км.
    /// </summary>
    R501840IIS,

    /// <summary>
    /// Рельс Р50 на щебне с деревянными шпалами, 1600 шт. на км.
    /// </summary>
    R501600IIS,
}
